module.exports = `
#---------- Список жанров fb2 ----------
0.1 Фантастика
0.2 Детективы и Триллеры
0.3 Проза
0.4 Любовные романы
0.5 Приключения
0.6 Литература для детей
0.7 Религия, духовность, эзотерика
0.8 Поэзия
0.9 Драматургия
0.10 Старинное
0.11 Фольклор
0.12 Наука, Образование
0.13 Искусство, Искусствоведение, Дизайн
0.14 Техника
0.15 Компьютеры и Интернет
0.16 Справочная литература
0.17 Документальная литература
0.18 Юмор
0.19 Дом и семья
0.20 Прочее
0.21 Деловая литература
0.22 Учебники и пособия
0.0 Неотсортированное
#---------- 0.1 Фантастика ----------
0.1.1 sf_history;Альтернативная история
0.1.2 sf_action;Боевая фантастика
0.1.3 sf_epic;Эпическая фантастика
0.1.4 sf_heroic;Героическая фантастика
0.1.5 sf_detective;Детективная фантастика
0.1.6 sf_cyberpunk;Киберпанк
0.1.7 sf_space;Космическая фантастика
0.1.8 sf_social;Социально-психологическая фантастика
0.1.9 sf_horror;Ужасы
0.1.10 sf_humor;Юмористическая фантастика
0.1.11 sf_fantasy;Фэнтези
0.1.12 sf;Научная Фантастика
0.1.124 sf_fantasy_city;Городское фэнтези
0.1.131 sf_postapocalyptic;Постапокалипсис
0.1.253 sf_litrpg;ЛитРПГ
0.1.226 sf_etc;Фантастика
0.1.227 russian_fantasy;Славянское фэнтези
0.1.228 sf_technofantasy;Технофэнтези
0.1.229 fairy_fantasy;Мифологическое фэнтези
0.1.230 hronoopera;Хроноопера
0.1.231 sf_mystic;Мистика
0.1.232 sf_stimpank;Стимпанк
0.1.233 modern_tale;Современная сказка
0.1.254 popadancy;Попаданцы
#---------- 0.2 Детективы и Триллеры ----------
0.2.13 det_classic;Классический детектив
0.2.14 det_police;Полицейский детектив
0.2.15 det_action;Боевик
0.2.16 det_irony;Иронический детектив, дамский детективный роман
0.2.17 det_history;Исторический детектив
0.2.18 det_espionage;Шпионский детектив
0.2.19 det_crime;Криминальный детектив
0.2.20 det_political;Политический детектив
0.2.21 det_maniac;Про маньяков
0.2.22 det_hard;Крутой детектив
0.2.23 thriller;Триллер
0.2.24 detective;Детективы
0.2.154 det_su;Советский детектив
#---------- 0.3 Проза ----------
0.3.25 prose;Проза
0.3.26 prose_classic;Классическая проза
0.3.27 prose_history;Историческая проза
0.3.28 prose_contemporary;Современная русская и зарубежная проза
0.3.29 prose_counter;Контркультура
0.3.30 prose_rus_classic;Русская классическая проза
0.3.31 prose_su_classics;Советская классическая проза
0.3.130 prose_military;Проза о войне
0.3.197 foreign_prose;Зарубежная классическая проза
0.3.198 foreign_antique;Средневековая классическая проза
0.3.199 literature_18;Классическая проза XVII-XVIII веков
0.3.200 literature_19;Классическая проза ХIX века
0.3.201 literature_20;Классическая проза ХX века
0.3.202 gothic_novel;Готический роман
0.3.203 prose_magic;Магический реализм
0.3.204 epistolary_fiction;Эпистолярная проза
0.3.205 prose_neformatny;Экспериментальная, неформатная проза
0.3.206 aphorisms;Афоризмы, цитаты
0.3.207 great_story;Роман, повесть
0.3.208 story;Малые литературные формы прозы: рассказы, эссе, новеллы, феерия
0.3.209 prose_abs;Фантасмагория, абсурдистская проза
#---------- 0.4 Любовные романы ----------
0.4.32 love_contemporary;Современные любовные романы
0.4.33 love_history;Исторические любовные романы
0.4.34 love_detective;Остросюжетные любовные романы
0.4.35 love_short;Короткие любовные романы
0.4.36 love_erotica;Эротическая литература
0.4.37 love;Любовные романы
0.4.148 love_sf;Любовное фэнтези, любовно-фантастические романы 
0.4.167 love_hard;Порно
#---------- 0.5 Приключения ----------
0.5.39 adv_history;Исторические приключения
0.5.40 adv_indian;Вестерн, про индейцев 
0.5.41 adv_maritime;Морские приключения
0.5.42 adv_geo;Путешествия и география
0.5.43 adv_animal;Природа и животные
0.5.44 adventure;Приключения
0.5.50 child_adv;Приключения для детей и подростков
0.5.194 adv_modern;Приключения в современном мире
0.5.195 tale_chivalry;Рыцарский роман
0.5.196 adv_story;Авантюрный роман
#---------- 0.6 Литература для детей ----------
0.6.45 child_tale;Сказки народов мира
0.6.46 child_verse;Стихи для детей
0.6.47 child_prose;Проза для детей
0.6.48 child_sf;Фантастика для детей
0.6.49 child_det;Детская остросюжетная литература
0.6.51 child_education;Детская образовательная литература
0.6.52 children;Детская литература
0.6.155 child_classical;Классическая детская литература
0.6.156 child_tale_rus;Русские сказки
0.6.157 foreign_children;Зарубежная литература для детей
0.6.158 prose_game;Игры, упражнения для детей
#---------- 0.7 Религия, духовность, эзотерика ----------
0.7.128 religion_budda;Буддизм
0.7.64 sci_religion;Религиоведение
0.7.95 religion_esoterics;Эзотерика, эзотерическая литература 
0.7.96 religion_self;Самосовершенствование
0.7.97 religion;Религия, религиозная литература
0.7.214 religion_christianity;Христианство
0.7.215 religion_orthodoxy;Православие
0.7.216 religion_protestantism;Протестантизм
0.7.217 religion_catholicism;Католицизм
0.7.218 religion_judaism;Иудаизм
0.7.219 religion_hinduism;Индуизм
0.7.220 religion_islam;Ислам
0.7.221 religion_paganism;Язычество
0.7.222 astrology;Астрология и хиромантия
#---------- 0.8 Поэзия ----------
0.8.53 poetry;Поэзия
0.8.100 humor_verse;Юмористические стихи, басни 
0.8.183 poetry_classical;Классическая поэзия
0.8.184 poetry_modern;Современная поэзия
0.8.185 poetry_rus_classical;Классическая русская поэзия
0.8.186 poetry_rus_modern;Современная русская поэзия
0.8.187 poetry_for_classical;Классическая зарубежная поэзия
0.8.188 poetry_for_modern;Современная зарубежная поэзия
0.8.189 poetry_east;Поэзия Востока
0.8.190 lyrics;Лирика
0.8.191 song_poetry;Песенная поэзия
0.8.192 poem;Поэма, эпическая поэзия
0.8.193 palindromes;Визуальная и экспериментальная поэзия, верлибры, палиндромы
#---------- 0.9 Драматургия ----------
0.9.54 dramaturgy;Драматургия
0.9.177 comedy;Комедия
0.9.178 tragedy;Трагедия
0.9.179 drama;Драма
0.9.180 drama_antique;Античная драма
0.9.181 screenplays;Сценарий
0.9.182 vaudeville;Мистерия, буффонада, водевиль
#---------- 0.10 Старинное ----------
0.10.55 antique_ant;Античная литература
0.10.56 antique_european;Европейская старинная литература
0.10.57 antique_russian;Древнерусская литература
0.10.58 antique_east;Древневосточная литература
0.10.60 antique;antique
#---------- 0.11 Фольклор ----------
0.11.59 antique_myths;Мифы. Легенды. Эпос
0.11.235 folklore;Фольклор, загадки folklore
0.11.236 folk_tale;Народные сказки
0.11.237 epic;Былины, эпопея
0.11.238 proverbs;Пословицы, поговорки
0.11.239 folk_songs;Народные песни
0.11.240 child_folklore;Детский фольклор
0.11.241 limerick;Частушки, прибаутки, потешки
#---------- 0.12 Наука, Образование ----------
0.12.61 sci_history;История
0.12.62 sci_psychology;Психология и психотерапия
0.12.65 sci_philosophy;Философия
0.12.66 sci_politics;Политика
0.12.68 sci_juris;Юриспруденция
0.12.69 sci_linguistic;Языкознание, иностранные языки
0.12.70 sci_medicine;Медицина
0.12.71 sci_phys;Физика
0.12.72 sci_math;Математика
0.12.73 sci_chem;Химия
0.12.74 sci_biology;Биология, биофизика, биохимия 
0.12.76 science;Научная литература
0.12.126 sci_cosmos;Астрономия и Космос
0.12.125 sci_geo;Геология и география
0.12.122 sci_state;Государство и право
0.12.121 sci_economy;Экономика
0.12.149 sci_medicine_alternative;Альтернативная медицина
0.12.150 sci_philology;Литературоведение
0.12.168 sci_popular;Зарубежная образовательная литература, зарубежная прикладная,  научно-популярная  литература
0.12.169 military_history;Военная история
0.12.170 sci_social_studies;Обществознание, социология
0.12.171 sci_zoo;Зоология
0.12.172 sci_botany;Ботаника
0.12.173 sci_ecology;Экология
0.12.174 sci_oriental;Востоковедение
0.12.175 sci_theories;Альтернативные науки и научные теории
0.12.176 sci_veterinary;Ветеринария
#---------- 0.13 Искусство, Искусствоведение, Дизайн ----------
0.13.63 sci_culture;Культурология
0.13.127 notes;Партитуры
0.13.91 nonf_criticism;Критика
0.13.92 design;Искусство и Дизайн
0.13.242 music;Музыка
0.13.243 painting;Живопись, альбомы, иллюстрированные каталоги
0.13.244 architecture_book;Скульптура и архитектура
0.13.245 art_world_culture;Мировая художественная культура
0.13.246 cine;Кино
0.13.247 theatre;Театр
0.13.248 art_criticism;Искусствоведение
#---------- 0.14 Техника ----------
0.14.75 sci_tech;Технические науки
0.14.120 sci_build;Строительство и сопромат
0.14.119 sci_radio;Радиоэлектроника
0.14.118 sci_metal;Металлургия
0.14.117 sci_transport;Транспорт и авиация
0.14.223 military_weapon;Военное дело, военная техника и вооружение
0.14.224 auto_business;Автодело
0.14.225 equ_history;История техники
#---------- 0.15 Компьютеры и Интернет ----------
0.15.77 comp_www;ОС и Сети, интернет
0.15.79 comp_hard;Компьютерное 'железо' (аппаратное обеспечение), цифровая обработка сигналов
0.15.81 comp_db;Программирование, программы, базы данных
0.15.83 computers;Зарубежная компьютерная, околокомпьютерная литература 
0.15.166 tbg_computers;Учебные пособия, самоучители
#---------- 0.16 Справочная литература ----------
0.16.84 ref_encyc;Энциклопедии
0.16.85 ref_dict;Словари
0.16.86 ref_ref;Справочники
0.16.87 ref_guide;Руководства
0.16.88 reference;Справочная литература
0.16.152 geo_guides;Путеводители, карты, атласы 
#---------- 0.17 Документальная литература ----------
0.17.89 nonf_biography;Биографии и Мемуары
0.17.90 nonf_publicism;Публицистика
0.17.93 nonfiction;Документальная литература
0.17.159 nonf_military;Военная документалистика и аналитика
0.17.160 military_special;Военное дело
0.17.161 travel_notes;География, путевые заметки
#---------- 0.18 Юмор ----------
0.18.98 humor_anecdote;Анекдоты
0.18.99 humor_prose;Юмористическая проза
0.18.101 humor;Юмор
0.18.234 humor_satire;Сатира
#---------- 0.19 Дом и семья ----------
0.19.102 home_cooking;Кулинария
0.19.103 home_pets;Домашние животные
0.19.104 home_crafts;Хобби и ремесла
0.19.105 home_entertain;Развлечения
0.19.106 home_health;Здоровье
0.19.107 home_garden;Сад и огород
0.19.108 home_diy;Сделай сам
0.19.109 home_sport;Боевые искусства, спорт 
0.19.110 home_sex;Семейные отношения, секс
0.19.111 home;Домоводство
0.19.162 sci_pedagogy;Педагогика, воспитание детей, литература для родителей 
0.19.163 auto_regulations;Автомобили и ПДД
0.19.164 home_collecting;Коллекционирование
0.19.165 family;Семейные отношения
#---------- 0.20 Прочее ----------
0.20.112 other;Неотсортированное
0.20.153 periodic;Журналы, газеты 
0.20.210 comics;Комиксы
0.20.211 unfinished;Незавершенное
0.20.212 fanfiction;Фанфик
0.20.213 network_literature;Самиздат, сетевая литература
#---------- 0.21 Деловая литература ----------
0.21.132 banking;Финансы
0.21.136 org_behavior;Маркетинг, PR
0.21.141 popular_business;Карьера, кадры
0.21.144 economics_ref;Деловая литература
0.21.147 economics;Экономика
#---------- 0.22 Учебники и пособия ----------
0.22.249 sci_textbook;Учебники и пособия
0.22.250 tbg_school;Школьные учебники и пособия, рефераты, шпаргалки
0.22.251 tbg_secondary;Учебники и пособия для среднего и специального образования
0.22.252 tbg_higher;Учебники и пособия ВУЗов
#---------- 2022-04-28 16:16:05.605170----------

#nonfb2
#---------- Список жанров НЕ-fb2 ----------#
0.1 study;Учебная литература
0.1.0 study_preschool;Дошкольникам
0.1.1 study_scool;Школьникам
0.1.2 study_students;Студентам
0.1.3 study_graduate;Аспирантам
0.2 home;Дом. Быт. Досуг
0.2.0 home_child;Дети. Книги для родителей
0.2.1 home_health;Красота. Здоровье.
0.2.2 home_handiwork;Рукоделие. Домоводство
0.2.3 home_garden;Сад, огород, цветник, дизайн участка
0.2.4 home_cooking;Кулинария
0.2.5 home_pets;Домашние питомцы
0.2.6 home_collecting;Коллекционирование
0.2.7 home_sex;Любовь, эротика
0.2.8 home_diy;Строительство, ремонт
0.2.9 home_crafts;Увлечения. Хобби
0.3 arts;Искусство
0.3.0 arts_albums;Альбомы по искусству. Фотоальбомы
0.3.1 art_visual;Изобразительное искусство. Архитектура
0.3.2 art_sci;Искусствоведение
0.3.3 art_film;Кино. Киноведение
0.3.4 art_dance;Танец. Хореография
0.3.5 art_theater;Театр. Сценическое искусство
0.3.6 design;Дизайн
0.4 languages;Иностранные языки
0.4.0 lang_rus;Русский язык
0.4.1 lag_eng;Английский язык
0.4.1.0 lang_eng_textbook;Учебники, пособия
0.4.1.1 lang_eng_dict;Словари
0.4.1.2 lang_eng_read;Домашнее чтение
0.4.1.3 lang_eng_theor;Теория и история
0.4.1.4 lang_eng_phrase;Разговорники
0.4.2 lang_arab;Арабский язык
0.4.3 lang_east;Восточные языки
0.4.4 lang_euro;Европейские языки
0.4.5 lang_spanish;Испанский язык
0.4.6 lang_it;Итальянский язык
0.4.7 lang_chi;Китайский язык
0.4.8 lang_korean;Корейский язык
0.4.9 lang_lat;Латинский язык
0.4.10 lang_de;Немецкий язык
0.4.11 lang_pl;Польский язык
0.4.12 lang_tu;Турецкий язык
0.4.13 lang_fr;Французский язык
0.4.14 lang_jap;Японский язык
0.4.15 lang_greek;Древнегреческий и другие древние языки
0.5 computers;Компьютерная литература
0.5.0 comp_soft_office;Офисные программы
0.5.1 comp_db;Базы данных
0.5.1.0 comp_db_db2;DB2
0.5.1.1 comp_db_mysql;MySQL
0.5.1.2 comp_db_mssqlserver;MS SQL Server
0.5.1.3 comp_db_oracle;Oracle
0.5.1.4 comp_db_postgresql;PostgreSQL
0.5.1.5 comp_db_sqlite;SQLite
0.5.1.6 comp_db_sybase;Sybase SQL
0.5.1.7 comp_dv_ai;Искуственный интеллект
0.5.1.8 comp_db_exp;Экспертные системы
0.5.2 comp_design;Графика. Дизайн. Мультимедиа
0.5.3 comp_www;Интернет и Web-страницы
0.5.3.0 comp_www_html;HTML
0.5.3.1 comp_www_css;CSS
0.5.3.2 comp_www_cms;CMS
0.5.4 comp_security;Компьютерная безопасность
0.5.5 comp_osnet;Сети
0.5.6 comp_soft;Компьютеры и программы
0.5.7 comp_os;Операционные системы
0.5.7.0 comp_os_windows;Windows
0.5.7.1 comp_os_linux;Linux
0.5.7.2 comp_os_unix;UNIX
0.5.8 comp_soft_dev;Разработка ПО
0.5.8.0 comp_soft_dev_alg;Алгоритмы
0.5.8.1 comp_soft_dev_man;Менеджмент
0.5.8.2 comp_soft_dev_debug;Отладка
0.5.9 comp_soft_cad;Системы проектирования
0.5.10 comp_programming;Языки и системы программирования
0.5.10.0 comp_prog_delphi;Delphi
0.5.10.1 comp_prog_pascal;Pascal
0.5.10.2 comp_prog_c;C
0.5.10.3 comp_prog_cpp;C++
0.5.10.3.0 comp_prog_gnuc;GNU C++
0.5.10.3.1 comp_prog_msvc;MS Visual Studio
0.5.10.3.2 comp_prog_qt;Qt
0.5.10.4 comp_prog_csharp;C#
0.5.10.5 comp_prog_java;Java
0.5.10.6 comp_prog_js;JavaScript
0.5.10.7 comp_prog_php;PHP
0.5.10.8 comp_prog_pyton;Pyton
0.5.10.9 comp_prog_ror;Ruby
0.5.11 comp_dig_photo;Цифровая фотография
0.5.12 comp_exam;Сертификационные экзамены
0.5.13 comp_hard;Железо
0.7 nonfiction;Публицистика
0.7.0 nonf_biography;Биографии, мемуары
0.7.1 nonf_publicism;Публицистика
0.7.2 nonf_criticism;Критика
0.8 Туризм. Фото. Спорт
0.8.0 turism;Путешествия. Туризм
0.8.1 auto;Автомобиль
0.8.3 fish;Рыбалка
0.8.4 hunt;Охота
0.8.5 sport;Спорт
0.9 religion;Религия. Изотерика
0.9.0 religion_esoterics;Эзотерика
0.9.1 religion_self;Самосовершенствование
0.9.2 religion_budda;Буддизм
0.10 science;Наука. Техника
0.10.0 sci_tech;Техника. Технические науки
0.10.0.0 sci_tech_industry;Промышленность
0.10.0.0.0 sci_tech_oil;Нефть, газ
0.10.0.0.1 sci_tech_machinery;Машиностроение
0.10.0.0.2 sci_metal;Металлургия
0.10.0.0.3 sci_tech_print;Полиграфия
0.10.0.0.4 sci_tech_chem;Химическая
0.10.0.1 sci_radio;Радиоэлектроника, радиотехника, связь
0.10.0.2 sci_build;Строительство
0.10.0.3 none;Технические науки
0.10.0.3.0 sci_tech_sopromat;Сопротивление материалов
0.10.0.3.1 sci_tech_theormech;Теория машин
0.10.0.3.2 sci_tech_ref;Справочники
0.10.0.4 sci_transport;Транспорт
0.10.0.5 sci_energy;Энергетика. Электротехника
0.10.1 none;Естественные науки
0.10.1.0 sci_phys;Физика
0.10.1.0.0 sci_phys_acustics;Акустика
0.10.1.0.1 sci_phys_quant;Квантовая механика. Теория поля
0.10.1.0.2 sci_phys_math;Математическая физика
0.10.1.0.3 sci_phys_molecular;Молекулярная физика. Физика газов и жидкостей
0.10.1.0.4 sci_phys_gen;Общие работы по физике
0.10.1.0.5 sci_phys_optics;Оптика
0.10.1.0.6 sci_phys_theor;Теоретическая физика
0.10.1.0.7 sci_phys_thermo;Термодинамика и статистическая физика
0.10.1.0.8 sci_phys_plasma;Физика плазмы
0.10.1.0.9 sci_phys_nuclear;Физика атомного ядра и элементарных частиц
0.10.1.0.10 sci_phys_solidstate;Физика твердого тела. Кристаллография
0.10.1.0.11 sci_phys_em;Электричество и магнетизм
0.10.1.0.12 sci_phys_ref;Энциклопедии, справочники, словари по физике
0.10.1.1 sci_chem;Химические
0.10.1.1.0 sci_hem_general;Общая химия
0.10.1.1.1 sci_orgchem;Органическая химия
0.10.1.1.2 sci_anachem;Аналитическая химия
0.10.1.1.3 sci_physchem;Физическая химия
0.10.1.2 none;Географические
0.10.1.3 sci_biology;Биологические
0.10.1.3.0 sci_biophys;Биофизика
0.10.1.4 sci_math;Математика
0.10.2 none;Ветеринария. Животноводство. Сельское хозяйство
0.10.3 sicial;Общественные и гуманитарные науки
0.10.3.0 sicial_var;Военное дело. Оружие. Спецслужбы
0.10.3.1 sicial_hist;История. Археология. Этнография
0.10.3.2 sicial_lit;Литературоведение. Фольклор
0.10.3.3 sicial_ped;Педагогика
0.10.3.4 sicial_pol;Политика
0.10.3.5 sicial_law;Право. Юриспруденция
0.10.3.6 sicial_psi;Психология
0.10.3.7 sicial_sicial;Социология
0.10.3.8 sicial_smi;Средства массовой информации. Книжное дело
0.10.3.9 sicial_stat;Статистика. Демография
0.10.3.10 sicial_phy;Философия
0.10.3.11 sicial_lang;Языкознание. Филологические науки
0.11 sci_medicine;Медицина
0.11.0 sci_medicine_alternative;Нетрадиционная медицина
0.12 reference;Справочная литература
0.12.0 ref_encyc;Энциклопедии
0.12.1 ref_dict;Словари
0.12.2 ref_ref;Справочники
0.12.3 ref_guide;Руководства
0.12.4 geo_guides;Путеводители
0.13 periodic;Периодика
0.13.0 periodic_newspaper;Газеты
0.13.1 periodic_mag;Журналы
0.0 none;Неотсортированное
`;